resources/www/app-hacking.org
#+HTML: <div class="container-fluid"><div class="row"><div class="col-md-7 col-md-offset-3 col-xs-12 col-sm-10 col-sm-offset-1 col-lg-6 col-lg-offset-3">
#+TITLE: App Hacking
#+HTML: <br><br>

There's been a lot of mobile + desktop app development work coming from
the JavaScript community in the last few years. Projects like [[https://nodejs.org/][NodeJS]] and
[[http://nwjs.io/][NW.js]] are great for desktop and there are too many mobile frameworks
to even try to name.  Unfortunately, ClojureScript has felt like a
second-class citizen during this, being shoehorned into whatever JS
frameworks get built. This has been OK but it leaves a lot to be desired. How can
we share code across platforms without running into UI/UX problems? Why
can't my mobile code be packaged for desktop too? Do we really have to
write a brand new set of UI components for every app we do? Why do we
have to deal with all those convoluted JS build tool configurations?

With the upcoming [[https://github.com/greenyouse/browserific][Browserific]] project we can start addressing some of
these questions and begin building apps without all the JS interop
craziness.

We'll start by looking at how to build component-based UIs and take a
quick trip through a few of the other major features. By the end you
should have a pretty good feel for how to use everything and the general
direction that the project is headed.

OK, let's get started!

#+HTML: <br>

