resources/public/app-hacking.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>App Hacking</title>
<!-- 2016-11-26 Sat 18:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ed Babcock (greenyouse)" />
<meta  name="description" content="Hacks, projects, and general butt-kicking with Ed (greenyouse)"
 />
<meta  name="keywords" content="Clojure, ClojureScript, greenyouse, LISP" />
<meta name='viewport' content='width=device-width' initial-scale=1>
                     <link rel='shortcut icon' href='/img/favicon.ico' />
                     <link rel='stylesheet' href='/css/bootstrap.min.css' type='text/css'/>
                     <link rel='stylesheet' href='/css/blog.css' type='text/css'/>
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar navbar-default">
    <div class="container-fluid">
      <div class="navbar-header">
        <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#main-navbar">
          <span class="sr-only">Toggle navigation</span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
        </button>
        <a class="navbar-brand" href="/index.html">EDBABCOCK</a>
      </div>
      <div class="collapse navbar-collapse" id="main-navbar">
        <ul class="nav navbar-nav">
          <li><a href="/about.html">About</a></li>
          <li><a href="categories.html">Categories</a></li>
        </ul>
      </div>
    </div>
  </nav>
</div>
<div id="content">
<h1 class="title">App Hacking</h1>
<div class="container-fluid"><div class="row"><div class="col-md-6 col-md-offset-3 col-xs-10 col-xs-offset-1 col-sm-8 col-sm-offset-2 col-lg-4 col-lg-offset-4">
<br><br>

<p>
There's been a lot of mobile + desktop app development work coming from
the JavaScript community in the last few years. Projects like <a href="https://nodejs.org/">NodeJS</a> and
<a href="http://nwjs.io/">NW.js</a> are great for desktop and there are too many mobile frameworks
to even try to name.  Unfortunately, ClojureScript has felt like a
second-class citizen during this, being shoehorned into whatever JS
frameworks get built. This has been OK but it leaves a lot to be desired. How can
we share code across platforms without running into UI/UX problems? Why
can't my mobile code be packaged for desktop too? Do we really have to
write a brand new set of UI components for every app we do? Why do we
have to deal with all those convoluted JS build tool configurations?
</p>

<p>
With the upcoming <a href="https://github.com/greenyouse/browserific">Browserific</a> project we can start addressing some of
these questions and begin building apps without all the JS interop
craziness.
</p>

<p>
We'll start by looking at how to build component-based UIs and take a
quick trip through a few of the other major features. By the end you
should have a pretty good feel for how to use everything and the general
direction that the project is headed.
</p>

<p>
OK, let's get started!
</p>

<br>
