resources/www/app-hacking.org
* Component UIs

  For the last year or so, ClojureScript people have had great success
  using React components in their UI work. With Browserific, we'll now
  get a couple more advantages: platform-specific feature expressions
  and reusable components.

#+HTML: <br>
#+HTML: <h4>Basic<small> (what we're currently using)</small></h4>

  For an example, take a look at this code for rendering a list:
  #+BEGIN_SRC clojure
    (defn list-c%1 [{:keys [data]}]
      [:section
       (reduce (fn [ul title]
                 (conj ul ^{:key (gensym)}
                       [:dt  {:on-click #(println title)}
                        [:p [:strong title]]]))
               [:dl] data)])

    ;; let's give it some stuff to render so we can see how it looks
    (list-c%1 {:data ["some" "stuff" "to" "render"]})
  #+END_SRC

  #+HTML: <br>
  #+HTML: <div id="list-example1"></div>
  #+HTML: <br>

  This is a basic HTML list without any feature expressions or
  styling. Using this is great for webapps but, as we'll see, it doesn't
  work well when trying to publish an app for multiple platforms.

  One other thing to note is how ~list-c~ is a component that renders
  lists of data, independent of the app's code. Components are abstract
  functions for rendering UI elements, they don't know what the data
  they're rendering is and they don't wanna know. For that reason, the
  only part that's really unique to this UI is the last line of code
  that calls the component.

#+HTML: <br>
#+HTML: <h4>Feature Expressions</h4>

  Now what if we want to render this in a mobile platform like
  FirefoxOS? For that we'd use a FirefoxOS feature expression!

  #+BEGIN_SRC clojure
    (defn list-c%2
      "A list of the items"
      [{:keys [data]}]
      (chenex/in-case!
       [:firefoxos] [:section {:data-type "list"}
                     (reduce (fn [ul title]
                               (conj ul ^{:key (gensym)}
                                     [:li [:a {:on-click #(println title)}
                                           [:aside {:class "pack-end"
                                                    :data-icon "forward"}]
                                           [:p [:strong title]]]]))
                             [:ul] data)]
       [:else] [:section
                (reduce (fn [ul title]
                          (conj ul ^{:key (gensym)}
                                [:dt  {:on-click #(println title)}
                                 [:p [:strong title]]]))
                        [:dl] data)]))

    (list-c%2 {:data ["some" "stuff" "to" "render"]})
  #+END_SRC

  #+HTML: <br>
  #+HTML: <div id="list-example2"></div>
  #+HTML: <br>

  This used the FirefoxOS markup but we didn't add the FirefoxOS CSS
  so it looks pretty much the same as our last list.


#+HTML: <br>
#+HTML: <h4>Resuable Components<small> (through ShadowDOMs)</small></h4>

  Now for the good stuff!

  If we create component libraries, two important requirements are that
  each component has proper styling and that all styles are
  encapsulated. This way we'll be able to write apps with components
  that "/just work/"^{TM} (i.e. the CSS will be packaged with the
  component). We'll talk more about styling later, for now check out
  this neat ShadowDOM example (you'll need *Chrome/Opera* or *Firefox* with
  the ~dom.webcomponents.enabled~ flag set to true):

  #+BEGIN_SRC clojure
    (defn header-c%3 [{:keys [title]}]
      [:section {:role "region"}
       [:header
        [:menu
         [:button {:data-icon "search"} ;data icons don't render yet
          [:span {:class "icon icon-search"}]]
         [:button
          [:span {:class "icon icon-compose"}]]]
        [:h1 title]]])

    (defn list-c%3 [{:keys [data]}]
      [:section {:data-type "list"}
       (reduce (fn [ul item]
                 (conj ul
                       [:li {:key (gensym)}
                        [:a {:on-click #(js/console.log item)} ;events not handled yet
                         [:aside {:class "pack-end"
                                  :data-icon "forward"}]
                         [:p [:strong item]]]]))
               [:ul] data)])

    (rum/defc example-list%3 < (shadow-dom ["css/dapps/index.css"]) []
      [:div
       (header-c%3 {:title "Hello Style!"})
       (list-c%3 {:data ["some" "stuff" "to" "render"]})])
  #+END_SRC
  #+HTML: <br>
  #+HTML: <div id="list-example3"></div>
  #+HTML: <br>

  OK, I admit that this is slightly underwhelming because it only half
  works, but hey it's *React + ShadowDOMs*! The idea with this is that you
  can write some components in ClojureScript, style them with a little
  CSS, and package them all in ShadowDOMs for anybody to use. With that
  we could create component libraries for common UI elements. Then when
  you want write an app, you'll be able to consume component libraries
  similar to how you might use a JS library like jQuery or Dojo.

  The [[http://caniuse.com/#feat=shadowdom][support for ShadowDOMs]] still isn't great but there's a
  [[https://github.com/WebComponents/webcomponentsjs][webcomponents polyfill]] that should help. I spent about a day and a
  half trying to get ShadowDOMs to cooperate with React and the polyfill
  and this is how far I've gotten so far. If it looks interesting, you
  should [[https://github.com/greenyouse/blog/src/dapps/core.cljx][take a peek]] at my work and try giving it a good thumping :D.

  #+HTML: <br>

