resources/public/app-hacking.html

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Component UIs</h2>
<div class="outline-text-2" id="text-1">
<p>
For the last year or so, ClojureScript people have had great success
using React components in their UI work. With Browserific, we'll now
get a couple more advantages: platform-specific feature expressions
and reusable components.
</p>

<br>
<h4>Basic<small> (what we're currently using)</small></h4>

<p>
For an example, take a look at this code for rendering a list:
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #FBDE2D;">defn</span> <span style="color: #ff1493;">list-c%1</span> [{<span style="color: #4c83ff;">:keys</span> [data]}]
  [<span style="color: #4c83ff;">:section</span>
   (<span style="color: #FF6400;">reduce</span> (<span style="color: #FBDE2D;">fn</span> [ul title]
             (<span style="color: #FF6400;">conj</span> ul ^{<span style="color: #4c83ff;">:key</span> (<span style="color: #FF6400;">gensym</span>)}
                   [<span style="color: #4c83ff;">:dt</span>  {<span style="color: #4c83ff;">:on-click</span> #(<span style="color: #FF6400;">println</span> title)}
                    [<span style="color: #4c83ff;">:p</span> [<span style="color: #4c83ff;">:strong</span> title]]]))
           [<span style="color: #4c83ff;">:dl</span>] data)])

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">let's give it some stuff to render so we can see how it looks</span>
(list-c%1 {<span style="color: #4c83ff;">:data</span> [<span style="color: #61CE3C;">"some"</span> <span style="color: #61CE3C;">"stuff"</span> <span style="color: #61CE3C;">"to"</span> <span style="color: #61CE3C;">"render"</span>]})
</pre>
</div>

<br>
<div id="list-example1"></div>
<br>

<p>
This is a basic HTML list without any feature expressions or
styling. Using this is great for webapps but, as we'll see, it doesn't
work well when trying to publish an app for multiple platforms.
</p>

<p>
One other thing to note is how <code>list-c</code> is a component that renders
lists of data, independent of the app's code. Components are abstract
functions for rendering UI elements, they don't know what the data
they're rendering is and they don't wanna know. For that reason, the
only part that's really unique to this UI is the last line of code
that calls the component.
</p>

<br>
<h4>Feature Expressions</h4>

<p>
Now what if we want to render this in a mobile platform like
FirefoxOS? For that we'd use a FirefoxOS feature expression!
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #FBDE2D;">defn</span> <span style="color: #ff1493;">list-c%2</span>
  <span style="color: #61CE3C;">"A list of the items"</span>
  [{<span style="color: #4c83ff;">:keys</span> [data]}]
  (<span style="color: #D8FA3C;">chenex</span><span style="color: #EDEDED; background-color: #000000;">/</span>in-case!
   [<span style="color: #4c83ff;">:firefoxos</span>] [<span style="color: #4c83ff;">:section</span> {<span style="color: #4c83ff;">:data-type</span> <span style="color: #61CE3C;">"list"</span>}
                 (<span style="color: #FF6400;">reduce</span> (<span style="color: #FBDE2D;">fn</span> [ul title]
                           (<span style="color: #FF6400;">conj</span> ul ^{<span style="color: #4c83ff;">:key</span> (<span style="color: #FF6400;">gensym</span>)}
                                 [<span style="color: #4c83ff;">:li</span> [<span style="color: #4c83ff;">:a</span> {<span style="color: #4c83ff;">:on-click</span> #(<span style="color: #FF6400;">println</span> title)}
                                       [<span style="color: #4c83ff;">:aside</span> {<span style="color: #4c83ff;">:class</span> <span style="color: #61CE3C;">"pack-end"</span>
                                                <span style="color: #4c83ff;">:data-icon</span> <span style="color: #61CE3C;">"forward"</span>}]
                                       [<span style="color: #4c83ff;">:p</span> [<span style="color: #4c83ff;">:strong</span> title]]]]))
                         [<span style="color: #4c83ff;">:ul</span>] data)]
   [<span style="color: #4c83ff;">:else</span>] [<span style="color: #4c83ff;">:section</span>
            (<span style="color: #FF6400;">reduce</span> (<span style="color: #FBDE2D;">fn</span> [ul title]
                      (<span style="color: #FF6400;">conj</span> ul ^{<span style="color: #4c83ff;">:key</span> (<span style="color: #FF6400;">gensym</span>)}
                            [<span style="color: #4c83ff;">:dt</span>  {<span style="color: #4c83ff;">:on-click</span> #(<span style="color: #FF6400;">println</span> title)}
                             [<span style="color: #4c83ff;">:p</span> [<span style="color: #4c83ff;">:strong</span> title]]]))
                    [<span style="color: #4c83ff;">:dl</span>] data)]))

(list-c%2 {<span style="color: #4c83ff;">:data</span> [<span style="color: #61CE3C;">"some"</span> <span style="color: #61CE3C;">"stuff"</span> <span style="color: #61CE3C;">"to"</span> <span style="color: #61CE3C;">"render"</span>]})
</pre>
</div>

<br>
<div id="list-example2"></div>
<br>

<p>
This used the FirefoxOS markup but we didn't add the FirefoxOS CSS
so it looks pretty much the same as our last list.
</p>


<br>
<h4>Resuable Components<small> (through ShadowDOMs)</small></h4>

<p>
Now for the good stuff!
</p>

<p>
If we create component libraries, two important requirements are that
each component has proper styling and that all styles are
encapsulated. This way we'll be able to write apps with components
that "<i>just work</i>"<sup>TM</sup> (i.e. the CSS will be packaged with the
component). We'll talk more about styling later, for now check out
this neat ShadowDOM example (you'll need <b>Chrome/Opera</b> or <b>Firefox</b> with
the <code>dom.webcomponents.enabled</code> flag set to true):
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #FBDE2D;">defn</span> <span style="color: #ff1493;">header-c%3</span> [{<span style="color: #4c83ff;">:keys</span> [title]}]
  [<span style="color: #4c83ff;">:section</span> {<span style="color: #4c83ff;">:role</span> <span style="color: #61CE3C;">"region"</span>}
   [<span style="color: #4c83ff;">:header</span>
    [<span style="color: #4c83ff;">:menu</span>
     [<span style="color: #4c83ff;">:button</span> {<span style="color: #4c83ff;">:data-icon</span> <span style="color: #61CE3C;">"search"</span>} <span style="color: #8B8989; font-style: italic;">;data icons don't render yet</span>
      [<span style="color: #4c83ff;">:span</span> {<span style="color: #4c83ff;">:class</span> <span style="color: #61CE3C;">"icon icon-search"</span>}]]
     [<span style="color: #4c83ff;">:button</span>
      [<span style="color: #4c83ff;">:span</span> {<span style="color: #4c83ff;">:class</span> <span style="color: #61CE3C;">"icon icon-compose"</span>}]]]
    [<span style="color: #4c83ff;">:h1</span> title]]])

(<span style="color: #FBDE2D;">defn</span> <span style="color: #ff1493;">list-c%3</span> [{<span style="color: #4c83ff;">:keys</span> [data]}]
  [<span style="color: #4c83ff;">:section</span> {<span style="color: #4c83ff;">:data-type</span> <span style="color: #61CE3C;">"list"</span>}
   (<span style="color: #FF6400;">reduce</span> (<span style="color: #FBDE2D;">fn</span> [ul item]
             (<span style="color: #FF6400;">conj</span> ul
                   [<span style="color: #4c83ff;">:li</span> {<span style="color: #4c83ff;">:key</span> (<span style="color: #FF6400;">gensym</span>)}
                    [<span style="color: #4c83ff;">:a</span> {<span style="color: #4c83ff;">:on-click</span> #(<span style="color: #D8FA3C;">js</span><span style="color: #EDEDED; background-color: #000000;">/</span>console.log item)} <span style="color: #8B8989; font-style: italic;">;events not handled yet</span>
                     [<span style="color: #4c83ff;">:aside</span> {<span style="color: #4c83ff;">:class</span> <span style="color: #61CE3C;">"pack-end"</span>
                              <span style="color: #4c83ff;">:data-icon</span> <span style="color: #61CE3C;">"forward"</span>}]
                     [<span style="color: #4c83ff;">:p</span> [<span style="color: #4c83ff;">:strong</span> item]]]]))
           [<span style="color: #4c83ff;">:ul</span>] data)])

(<span style="color: #D8FA3C;">rum</span><span style="color: #EDEDED; background-color: #000000;">/</span><span style="color: #FBDE2D;">defc</span> <span style="color: #ff1493;">example-list%3</span> &lt; (shadow-dom [<span style="color: #61CE3C;">"css/dapps/index.css"</span>]) []
  [<span style="color: #4c83ff;">:div</span>
   (header-c%3 {<span style="color: #4c83ff;">:title</span> <span style="color: #61CE3C;">"Hello Style!"</span>})
   (list-c%3 {<span style="color: #4c83ff;">:data</span> [<span style="color: #61CE3C;">"some"</span> <span style="color: #61CE3C;">"stuff"</span> <span style="color: #61CE3C;">"to"</span> <span style="color: #61CE3C;">"render"</span>]})])
</pre>
</div>
<br>
<div id="list-example3"></div>
<br>

<p>
OK, I admit that this is slightly underwhelming because it only half
works, but hey it's <b>React + ShadowDOMs</b>! The idea with this is that you
can write some components in ClojureScript, style them with a little
CSS, and package them all in ShadowDOMs for anybody to use. With that
we could create component libraries for common UI elements. Then when
you want write an app, you'll be able to consume component libraries
similar to how you might use a JS library like jQuery or Dojo.
</p>

<p>
The <a href="http://caniuse.com/#feat=shadowdom">support for ShadowDOMs</a> still isn't great but there's a
<a href="https://github.com/WebComponents/webcomponentsjs">webcomponents polyfill</a> that should help. I spent about a day and a
half trying to get ShadowDOMs to cooperate with React and the polyfill
and this is how far I've gotten so far. If it looks interesting, you
should <a href="https://github.com/greenyouse/blog/blob/master/src/dapps/core.cljx#L57">take a peek</a> at my work and try giving it a good thumping :D.
</p>

<br>
</div>
</div>
